num = int(input("Введіть час, що пройшов від початку дня, у секундах:"))#Користувач вводить із клавіатури час у секундах, що минув від початку дня. Залежно від вибору користувача потрібно порахувати скільки годин, хвилин і секунд залишилося до опівночі.

act = input("Виберіть формат обрахнунку часу: 1 - години, 2 - хвилини, 3 - секунди: ")

if act == "1":
    print("До опівночі залишилося", 24 - num // 3600, "годин")
elif act == "2":
    print("До опівночі залишилося", 1440 - num // 60, "хвилин")
elif act == "3":
    print("До опівночі залишилося", 86400 - num, "секунд")